/*
4. Дано двузначное число. 
Вывести на экран количество десятков и единиц в нём. 
*/
#include <stdio.h>

int main()
{
   int a;
   
   printf("Введите двузначное число a = ");
   scanf("%d", &a);
//   printf(" int a = %d \n", a);
   while(a<10 || a>99)
   {
      printf("Ошибка! (a > 10 и a < 100) \n");
      printf("Введите двузначное число a =  ");
      scanf("%d", &a);
   }
   
   printf("Количество десятков -> %d \n", a/10); 
   printf("Количество единиц -> %d \n", a%10); 
   
   return 0; 
}