/* Окулов стр.18 задача 2.42*/

#include <stdio.h>

int main()
{
	int y;
//	int x, x1;
	puts("По заданному Y найти X.");
	
	printf("Y - трехзначное число, не заканчивается на 0.\n Введите Y = ");
	scanf("%d", &y);
	
	while(100 > y || y > 999 || (y%10==0))
	{
			printf("Y - трехзначное число, не заканчивается на 0.\n Введите Y = ");
			scanf("%d", &y);
	}

/*		
	x = (y/100);
	printf("x = %d \n", x);
	x1 = (y%100)*10;
	printf("x1 = %d \n", x1);
*/
	
	printf("x = %d \n", y%100*10 + y/100);
	
	return 0;
}