/*
 Программа к учебнику информатики для 10 класса
 К.Ю. Полякова и Е.А. Еремина.
 Глава 8.
 Программа № 6. Форматный вывод
 Вход: 
   нет 
 Результат:
   >123<  
   >  123<  
   >123  <
   >123.456001<
   >1.234560E+002<<
   >123.456<
   >    123.46<  
   > 1.23E+002<
   >  1.2E+002<
*/
#include <stdio.h>

main()
{
   int a = 123;
   float x = 123.456;
   printf(">%d<\n", a);
   printf(">%5d<\n", a);
   printf(">%-5d<\n", a);
   printf(">%f<\n", x );
   printf(">%e<\n", x );
   printf(">%g<\n", x );
   printf(">%10.2f<\n", x );
   printf(">%10.2e<\n", x );
   printf(">%10.2g<\n", x );
   getchar();
}
