/*
 Программа к учебнику информатики для 10 класса
 К.Ю. Полякова и Е.А. Еремина.
 Глава 8.
 Программа № 8. Условные операторы
 Вход: 
   5 7
 Результат:
   7
   7
   7
   7
*/ 
#include <stdio.h>

main()
{
  int a, b, c, M, i;
  printf("Введите два целых числа: ");
  scanf("%d%d", &a, &b);  
  printf("Максимальное число: \n");
  for ( i=1; i<=2; i++ ) { 
    if ( a > b ) 
         M = a;
    else M = b;
    printf ( "%d\n", M );  
    M = a;
    if ( b > a ) M = b;
    printf ( "%d\n", M );  
    c = a; a = b; b = c;
    }
  getchar();
}
