/*

*/
#include <stdio.h>

int main()
{
  unsigned char a, r, m;

  a = 0xCA;
  printf("%02X \n", a);
/*
По-битовый вывод.
*/  
  printf("%d%d%d%d%d%d%d%d\n", a >> 7, (a >> 6) % 2, (a >> 5) % 2, (a >> 4) % 2, (a >> 3) % 2, (a >> 2) % 2, (a >> 1) % 2, a % 2);
/*
По-битовое отрицание.
*/
  r = ~a;
  printf("%02X \n", r);
  printf("%d%d%d%d%d%d%d%d\n", r >> 7, (r >> 6) % 2, (r >> 5) % 2, (r >> 4) % 2, (r >> 3) % 2, (r >> 2) % 2, (r >> 1) % 2, r % 2);

/*
Битовая маска.
*/
  m = 0x0f;
  r = a & m;
  printf("%02X \n", r);
  printf("%d%d%d%d%d%d%d%d\n", r >> 7, (r >> 6) % 2, (r >> 5) % 2, (r >> 4) % 2, (r >> 3) % 2, (r >> 2) % 2, (r >> 1) % 2, r % 2);

  r = a | m;
  printf("%02X \n", r);
  printf("%d%d%d%d%d%d%d%d\n", r >> 7, (r >> 6) % 2, (r >> 5) % 2, (r >> 4) % 2, (r >> 3) % 2, (r >> 2) % 2, (r >> 1) % 2, r % 2);

  r = a ^ m;
  printf("%02X \n", r);
  printf("%d%d%d%d%d%d%d%d\n", r >> 7, (r >> 6) % 2, (r >> 5) % 2, (r >> 4) % 2, (r >> 3) % 2, (r >> 2) % 2, (r >> 1) % 2, r % 2);


  r = a & ~m;
  printf("%02X \n", r);
  printf("%d%d%d%d%d%d%d%d\n", r >> 7, (r >> 6) % 2, (r >> 5) % 2, (r >> 4) % 2, (r >> 3) % 2, (r >> 2) % 2, (r >> 1) % 2, r % 2);
/*
Сдвиг на два разряда.
*/
  r = a << 2;
  printf("%02X \n", r);
  printf("%d%d%d%d%d%d%d%d\n", r >> 7, (r >> 6) % 2, (r >> 5) % 2, (r >> 4) % 2, (r >> 3) % 2, (r >> 2) % 2, (r >> 1) % 2, r % 2);

  r = a >> 2;
  printf("%02X \n", r);
  printf("%d%d%d%d%d%d%d%d\n", r >> 7, (r >> 6) % 2, (r >> 5) % 2, (r >> 4) % 2, (r >> 3) % 2, (r >> 2) % 2, (r >> 1) % 2, r % 2);

  return 0;
}